城市 = ["台北市", "新北市", "桃園市", "台中市", "台南市", "高雄市", "台北市",
      "新北市", "桃園市", "高雄市", "高雄市", "台北市", "新北市"]
行政區 = ["中正區", "板橋區", "桃園區", "北屯區", "安南區", "三民區", "大安區",
       "永和區", "八德區", "前鎮區", "鳳山區", "信義區", "新店區"]
人口數 = [159598, 551452, 441287, 275207, 192327, 343203, 309835, 222531,
       198473, 189623, 359125, 225561, 302070]
zipped = zip(城市, 行政區, 人口數)
limit = int(input("請設定人口數的門檻值:"))
print("\t城市\t行政區\t人口數")
print("=================================")
for index, value in enumerate(list(zipped)):
    if(value[2]>limit):
       print("{:>2d}\t{:3s}\t{:3s}\t{:6d}".format(
              index+1, value[0], value[1], value[2]))
